<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <title>十步學習法 | 威爾進化論</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x8EAB;&amp;#x70BA;&amp;#x4E00;&amp;#x500B;&amp;#x5728;IT&amp;#x7522;&amp;#x696D;&amp;#x6253;&amp;#x6EFE;&amp;#x7684;&amp;#x4EBA;&amp;#xFF0C;&amp;#x4E0D;&amp;#x65B7;&amp;#x7684;&amp;#x5B78;&amp;#x7FD2;&amp;#x8207;&amp;#x66F4;&amp;#x65B0;&amp;#x77E5;&amp;#x8B58;&amp;#x5C0D;&amp;#x6211;&amp;#x501">
<meta property="og:type" content="article">
<meta property="og:title" content="十步學習法">
<meta property="og:url" content="http://yoursite.com/2017/02/25/10-step-learning/index.html">
<meta property="og:site_name" content="威爾進化論">
<meta property="og:description" content="&amp;#x8EAB;&amp;#x70BA;&amp;#x4E00;&amp;#x500B;&amp;#x5728;IT&amp;#x7522;&amp;#x696D;&amp;#x6253;&amp;#x6EFE;&amp;#x7684;&amp;#x4EBA;&amp;#xFF0C;&amp;#x4E0D;&amp;#x65B7;&amp;#x7684;&amp;#x5B78;&amp;#x7FD2;&amp;#x8207;&amp;#x66F4;&amp;#x65B0;&amp;#x77E5;&amp;#x8B58;&amp;#x5C0D;&amp;#x6211;&amp;#x501">
<meta property="og:updated_time" content="2017-02-25T15:52:01.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="十步學習法">
<meta name="twitter:description" content="&amp;#x8EAB;&amp;#x70BA;&amp;#x4E00;&amp;#x500B;&amp;#x5728;IT&amp;#x7522;&amp;#x696D;&amp;#x6253;&amp;#x6EFE;&amp;#x7684;&amp;#x4EBA;&amp;#xFF0C;&amp;#x4E0D;&amp;#x65B7;&amp;#x7684;&amp;#x5B78;&amp;#x7FD2;&amp;#x8207;&amp;#x66F4;&amp;#x65B0;&amp;#x77E5;&amp;#x8B58;&amp;#x5C0D;&amp;#x6211;&amp;#x501">
  
    <link rel="alternate" href="/atom.xml" title="威爾進化論" type="application/atom+xml">
  
  
    <link rel="icon" href="/favicon.png">
  
  
    <link href="//fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
  
  <link rel="stylesheet" href="/css/style.css">
  

</head>

<body>
  <div id="container">
    <div id="wrap">
      <header id="header">
  <div id="banner"></div>
  <div id="header-outer" class="outer">
    <div id="header-title" class="inner">
      <h1 id="logo-wrap">
        <a href="/" id="logo">威爾進化論</a>
      </h1>
      
        <h2 id="subtitle-wrap">
          <a href="/" id="subtitle">持續學習 追尋更好的自己</a>
        </h2>
      
    </div>
    <div id="header-inner" class="inner">
      <nav id="main-nav">
        <a id="main-nav-toggle" class="nav-icon"></a>
        
          <a class="main-nav-link" href="/">Home</a>
        
          <a class="main-nav-link" href="/archives">Archives</a>
        
      </nav>
      <nav id="sub-nav">
        
          <a id="nav-rss-link" class="nav-icon" href="/atom.xml" title="RSS Feed"></a>
        
        <a id="nav-search-btn" class="nav-icon" title="Search"></a>
      </nav>
      <div id="search-form-wrap">
        <form action="//google.com/search" method="get" accept-charset="UTF-8" class="search-form"><input type="search" name="q" results="0" class="search-form-input" placeholder="Search"><button type="submit" class="search-form-submit">&#xF002;</button><input type="hidden" name="sitesearch" value="http://yoursite.com"></form>
      </div>
    </div>
  </div>
</header>
      <div class="outer">
        <section id="main"><article id="post-10-step-learning" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-meta">
    <a href="/2017/02/25/10-step-learning/" class="article-date">
  <time datetime="2017-02-25T10:15:24.000Z" itemprop="datePublished">2017-02-25</time>
</a>
    
  <div class="article-category">
    <a class="article-category-link" href="/categories/個人成長/">個人成長</a>
  </div>

  </div>
  <div class="article-inner">
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      十步學習法
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x8EAB;&#x70BA;&#x4E00;&#x500B;&#x5728;IT&#x7522;&#x696D;&#x6253;&#x6EFE;&#x7684;&#x4EBA;&#xFF0C;&#x4E0D;&#x65B7;&#x7684;&#x5B78;&#x7FD2;&#x8207;&#x66F4;&#x65B0;&#x77E5;&#x8B58;&#x5C0D;&#x6211;&#x5011;&#x4F86;&#x8AAA;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;&#x4F46;&#x6700;&#x8FD1;&#x6211;&#x537B;&#x958B;&#x59CB;&#x5C0D;&#x5B78;&#x7FD2;&#x611F;&#x5230;&#x300C;&#x75B2;&#x618A;&#x300D;&#xFF0C;&#x7E3D;&#x89BA;&#x5F97;&#x8981;&#x5B78;&#x7684;&#x6771;&#x897F;&#x8DDF;&#x6D77;&#x4E00;&#x6A23;&#x5EE3;&#x3002;&#x800C;&#x6700;&#x6050;&#x6016;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x82B1;&#x4E86;&#x6578;&#x661F;&#x671F;&#x5B78;&#x7FD2;&#x7684;&#x6280;&#x8853;&#xFF0C;&#x7D93;&#x904E;&#x4E00;&#x6BB5;&#x6642;&#x9593;&#x6C92;&#x7528;&#x5F8C;&#xFF0C;&#x5C45;&#x7136;&#x5FD8;&#x4E86;&#x4E00;&#x534A;&#x4EE5;&#x4E0A;&#x3002;&#x6211;&#x958B;&#x59CB;&#x601D;&#x8003;&#x662F;&#x4EC0;&#x9EBC;&#x539F;&#x56E0;&#x6240;&#x5C0E;&#x81F4;&#xFF0C;&#x76F4;&#x5230;&#x6211;&#x767C;&#x73FE;&#x4E86; John Sonmez &#x9019;&#x865F;&#x4EBA;&#x7269;&#x3002;<br><a id="more"></a></p>
<h2 id="&#x7C21;&#x4ECB;"><a href="#&#x7C21;&#x4ECB;" class="headerlink" title="&#x7C21;&#x4ECB;"></a>&#x7C21;&#x4ECB;</h2><p>&#x300C;&#x5341;&#x6B65;&#x5B78;&#x7FD2;&#x6CD5;&#x300D;&#x662F; John Sonmez &#x4ED6;&#x81EA;&#x8EAB;&#x6240;&#x5EFA;&#x7ACB;&#x7684;&#x5341;&#x6B65;&#x9A5F;&#x5B78;&#x7FD2;&#x6CD5;&#xFF0C;&#x64DA;&#x8AAA;&#x4ED6;&#x672C;&#x4EBA;&#x4F7F;&#x7528;&#x6B64;&#x65B9;&#x6CD5;&#x5F8C;&#xFF0C;&#x5B78;&#x7FD2;&#x901F;&#x5EA6;&#x63D0;&#x5347;&#x4E86;3&#x500D;&#xFF0C;&#x8166;&#x888B;&#x4E5F;&#x80FD;&#x8A18;&#x4F4F;&#x66F4;&#x591A;&#x7684;&#x6771;&#x897F;&#x3002;</p>
<blockquote>
<p>&#x5728; John Sonmez &#x7684;&#x8457;&#x4F5C; &lt;Soft Skills: The software developer&#x2019;s life manual&gt; &#x4E2D;&#x6709;&#x63D0;&#x5230;&#x300C;&#x5341;&#x6B65;&#x5B78;&#x7FD2;&#x6CD5;&#x300D;&#x3002;</p>
</blockquote>
<p>&#x300C;&#x5341;&#x6B65;&#x5B78;&#x7FD2;&#x6CD5;&#x300D;&#x53EF;&#x5206;&#x70BA;&#x4EE5;&#x4E0B;&#x5169;&#x500B;&#x968E;&#x6BB5;&#xFF1A;</p>
<ol>
<li><p>&#x5B78;&#x7FD2;&#x524D;&#x6E96;&#x5099;&#xFF1A;<br>&#x70BA;&#x7B2C;1~6&#x6B65;&#x9A5F;&#x3002;&#x5728;&#x958B;&#x59CB;&#x5B78;&#x7FD2;&#x524D;&#xFF0C;&#x4F60;&#x5FC5;&#x9808;&#x6E05;&#x695A;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x8981;&#x5B78;&#x4E9B;&#x4EC0;&#x9EBC;&#xFF0C;&#x4E26;&#x5C0B;&#x627E;&#x5C0D;&#x7684;&#x8CC7;&#x6E90;&#x4F86;&#x5E6B;&#x52A9;&#x81EA;&#x5DF1;&#x5BE6;&#x73FE;&#x5B78;&#x7FD2;&#x7684;&#x76EE;&#x6A19;&#x8207;&#x8A08;&#x756B;&#x3002;</p>
</li>
<li><p>&#x958B;&#x59CB;&#x5B78;&#x7FD2;&#xFF1A;<br>&#x70BA;&#x7B2C;7~10&#x6B65;&#x9A5F;&#x3002;&#x901A;&#x904E;&#x300C;&#x5B78;&#x7FD2;&#x3001;&#x5BE6;&#x4F5C;&#x3001;&#x638C;&#x63E1;&#x3001;&#x6559;&#x6388;&#x300D;4&#x500B;&#x5FAA;&#x74B0;&#x6B65;&#x9A5F;&#x4F86;&#x9010;&#x6B65;&#x5B8C;&#x6210;&#x5B78;&#x7FD2;&#x8A08;&#x756B;&#x8207;&#x76EE;&#x6A19;&#xFF0C;&#x5E6B;&#x52A9;&#x81EA;&#x5DF1;&#x9818;&#x609F;&#x77E5;&#x8B58;&#x3002;</p>
</li>
</ol>
<h2 id="&#x7B2C;&#x4E00;&#x6B65;-&#x4E86;&#x89E3;&#x5168;&#x5C40;"><a href="#&#x7B2C;&#x4E00;&#x6B65;-&#x4E86;&#x89E3;&#x5168;&#x5C40;" class="headerlink" title="&#x7B2C;&#x4E00;&#x6B65; - &#x4E86;&#x89E3;&#x5168;&#x5C40;"></a>&#x7B2C;&#x4E00;&#x6B65; - &#x4E86;&#x89E3;&#x5168;&#x5C40;</h2><p>&#x958B;&#x59CB;&#x5B78;&#x7FD2;&#x524D;&#xFF0C;&#x5FC5;&#x9700;&#x5148;&#x5C0D;&#x6108;&#x5B78;&#x7FD2;&#x7684;&#x6280;&#x8853;&#x6216;&#x4E8B;&#x7269;&#x6709;&#x500B;&#x5B8F;&#x89C0;&#x7684;&#x4E86;&#x89E3;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;</p>
<blockquote>
<p>&#x9019;&#x6280;&#x8853;&#x662F;&#x4EC0;&#x9EBC;&#xFF1F;<br>&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x9EBC;&#xFF1F;<br>&#x8D77;&#x6E90;&#x8207;&#x6B77;&#x53F2;<br>&#x8207;&#x76F8;&#x8FD1;&#x6280;&#x8853;&#x7684;&#x6BD4;&#x8F03;&#x8207;&#x512A;&#x7F3A;&#x9EDE;</p>
</blockquote>
<h2 id="&#x7B2C;&#x4E8C;&#x6B65;-&#x78BA;&#x5B9A;&#x7BC4;&#x570D;"><a href="#&#x7B2C;&#x4E8C;&#x6B65;-&#x78BA;&#x5B9A;&#x7BC4;&#x570D;" class="headerlink" title="&#x7B2C;&#x4E8C;&#x6B65; - &#x78BA;&#x5B9A;&#x7BC4;&#x570D;"></a>&#x7B2C;&#x4E8C;&#x6B65; - &#x78BA;&#x5B9A;&#x7BC4;&#x570D;</h2><p>&#x63CF;&#x8FF0;&#x5B78;&#x7FD2;&#x76EE;&#x7684;&#xFF0C;&#x4E26;&#x4F9D;&#x7167;&#x76EE;&#x7684;&#x8207;&#x4F86;&#x5B9A;&#x7FA9;&#x5B78;&#x7FD2;&#x7BC4;&#x570D;&#xFF0C;&#x4F46;&#x82E5;&#x6709;&#x6642;&#x9593;&#x6216;&#x662F;&#x5176;&#x4ED6;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x4E5F;&#x5FC5;&#x9808;&#x8003;&#x616E;&#x9032;&#x53BB;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x662F;&#x70BA;&#x4E86;&#x5DE5;&#x4F5C;&#x4E0A;&#x61C9;&#x7528;&#x55CE;&#xFF1F;&#x6216;&#x662F;&#x56E0;&#x70BA;&#x89BA;&#x5F97;&#x6709;&#x8DA3;&#xFF1F;</p>
<ol>
<li><p>&#x4EE5;&#x5DE5;&#x4F5C;&#x61C9;&#x7528;&#x4F86;&#x8AAA;&#xFF0C;&#x82E5;&#x6709;&#x4E00;&#x500B;&#x5DE5;&#x5177;&#x80FD;&#x756B;&#x51FA;&#x9577;&#x689D;&#x5716;&#x3001;&#x5713;&#x9905;&#x5716;&#x3001;&#x66F2;&#x7DDA;&#x5716;&#x2026;&#x7B49;&#xFF0C;&#x4F46;&#x6211;&#x73FE;&#x5728;&#x7684;Project&#x53EA;&#x8981;&#x7528;&#x5230;&#x5713;&#x9905;&#x5716;&#xFF0C;&#x90A3;&#x6211;&#x53EA;&#x9700;&#x8981;&#x5C07;&#x5B78;&#x7FD2;&#x7BC4;&#x570D;&#x8A02;&#x5728;&#x300C;&#x5B78;&#x6703;&#x756B;&#x51FA;&#x5713;&#x9905;&#x5716;&#x7684;&#x65B9;&#x6CD5;&#x300D;&#x5C31;&#x597D;&#x3002;</p>
</li>
<li><p>&#x82E5;&#x53EA;&#x662F;&#x56E0;&#x70BA;&#x6709;&#x8DA3;&#x6240;&#x4EE5;&#x5B78;&#x7FD2;&#xFF0C;&#x7121;&#x6CD5;&#x63CF;&#x8FF0;&#x76EE;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x5148;&#x9032;&#x5165;&#x4E0B;&#x4E00;&#x6B65;&#x9A5F;&#x5B9A;&#x7FA9;&#x76EE;&#x6A19;&#x5F8C;&#xFF0C;&#x518D;&#x4F9D;&#x76EE;&#x6A19;&#x56DE;&#x4F86;&#x601D;&#x8003;&#x7BC4;&#x570D;&#x3002;</p>
</li>
</ol>
<h2 id="&#x7B2C;&#x4E09;&#x6B65;-&#x5B9A;&#x7FA9;&#x76EE;&#x6A19;"><a href="#&#x7B2C;&#x4E09;&#x6B65;-&#x5B9A;&#x7FA9;&#x76EE;&#x6A19;" class="headerlink" title="&#x7B2C;&#x4E09;&#x6B65; - &#x5B9A;&#x7FA9;&#x76EE;&#x6A19;"></a>&#x7B2C;&#x4E09;&#x6B65; - &#x5B9A;&#x7FA9;&#x76EE;&#x6A19;</h2><p>&#x5B9A;&#x7FA9;&#x4E00;&#x500B;&#x5177;&#x9AD4;&#x660E;&#x78BA;&#x7684;&#x76EE;&#x6A19;&#xFF0C;&#x7528;&#x4F86;&#x9A57;&#x8B49;&#x81EA;&#x5DF1;&#x662F;&#x5426;&#x771F;&#x7684;&#x5B78;&#x6703;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;</p>
<blockquote>
<p>&#x7528;Angularjs&#x5BEB;&#x4E00;&#x500B;&#x80FD;&#x65B0;&#x589E;&#x3001;&#x522A;&#x9664;&#x3001;&#x4FEE;&#x6539;&#x7684;todolist&#x61C9;&#x7528;&#x7A0B;&#x5F0F;&#x3002;<br>&#x7528;Python&#x5BEB;&#x4E00;&#x500B;&#x80FD;&#x722C;&#x4ECA;&#x65E5;Yahoo&#x9AD4;&#x80B2;&#x65B0;&#x805E;&#x7684;&#x722C;&#x87F2;&#x7A0B;&#x5F0F;&#x3002;</p>
</blockquote>
<h2 id="&#x7B2C;&#x56DB;&#x6B65;-&#x5C0B;&#x627E;&#x8CC7;&#x6E90;"><a href="#&#x7B2C;&#x56DB;&#x6B65;-&#x5C0B;&#x627E;&#x8CC7;&#x6E90;" class="headerlink" title="&#x7B2C;&#x56DB;&#x6B65; - &#x5C0B;&#x627E;&#x8CC7;&#x6E90;"></a>&#x7B2C;&#x56DB;&#x6B65; - &#x5C0B;&#x627E;&#x8CC7;&#x6E90;</h2><p>&#x76E1;&#x53EF;&#x80FD;&#x7684;&#x8490;&#x96C6;&#x95DC;&#x65BC;&#x4F60;&#x5B78;&#x7FD2;&#x7BC4;&#x570D;&#x5167;&#x7684;&#x8CC7;&#x6E90;&#xFF0C;&#x5148;&#x4E0D;&#x8003;&#x616E;&#x54C1;&#x8CEA;&#x7684;&#x597D;&#x58DE;&#xFF0C;&#x6211;&#x5011;&#x6703;&#x5728;&#x7B2C;&#x516D;&#x6B65;&#x904E;&#x6FFE;&#x6389;&#x4E0D;&#x9069;&#x5408;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x53EF;&#x4EE5;&#x662F;&#x5B98;&#x65B9;&#x6587;&#x4EF6;&#x3001;&#x90E8;&#x843D;&#x683C;&#x6587;&#x7AE0;&#x3001;&#x4E00;&#x672C;&#x66F8;&#x2026;&#x7B49;&#x3002;</p>
</blockquote>
<h2 id="&#x7B2C;&#x4E94;&#x6B65;-&#x5275;&#x5EFA;&#x5B78;&#x7FD2;&#x8A08;&#x756B;"><a href="#&#x7B2C;&#x4E94;&#x6B65;-&#x5275;&#x5EFA;&#x5B78;&#x7FD2;&#x8A08;&#x756B;" class="headerlink" title="&#x7B2C;&#x4E94;&#x6B65; - &#x5275;&#x5EFA;&#x5B78;&#x7FD2;&#x8A08;&#x756B;"></a>&#x7B2C;&#x4E94;&#x6B65; - &#x5275;&#x5EFA;&#x5B78;&#x7FD2;&#x8A08;&#x756B;</h2><p>&#x4F9D;&#x7167;&#x5B78;&#x7FD2;&#x7BC4;&#x570D;&#x5275;&#x5EFA;&#x4F60;&#x7684;&#x5B78;&#x7FD2;&#x8A08;&#x5283;&#xFF0C;&#x78BA;&#x4FDD;&#x81EA;&#x5DF1;&#x5728;&#x6B63;&#x78BA;&#x7684;&#x5B78;&#x7FD2;&#x8DEF;&#x5F91;&#x4E0A;&#x3002;<br>&#x5982;&#x679C;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x9EBC;&#x505A;&#x7684;&#x8A71;&#xFF0C;&#x53EF;&#x53C3;&#x8003;&#x4E0A;&#x4E00;&#x6B65;&#x90A3;&#x4E9B;&#x8CC7;&#x6E90;&#x4E2D;&#x7684;&#x76EE;&#x9304;&#x7D50;&#x69CB;&#xFF0C;&#x770B;&#x770B;&#x5225;&#x4EBA;&#x6559;&#x5B78;&#x9806;&#x5E8F;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x500B;&#x4EBA;&#x7684;&#x5B78;&#x7FD2;&#x8A08;&#x756B;&#x6703;&#x50CF;&#x66F8;&#x7684;&#x76EE;&#x9304;&#x4E00;&#x6A23;&#xFF0C;&#x9996;&#x5148;&#x4EE5;&#x5927;&#x65B9;&#x5411;&#x958B;&#x59CB;&#x898F;&#x5283;(&#x66F8;&#x7684;&#x7AE0;&#x7BC0;)&#xFF0C;&#x82E5;&#x6709;&#x9700;&#x8981;&#x518D;&#x5207;&#x6210;&#x8F03;&#x5C0F;&#x7684;&#x9805;&#x76EE;(&#x7AE0;&#x7BC0;&#x5167;&#x5BB9;)&#x3002;</p>
</blockquote>
<h2 id="&#x7B2C;&#x516D;&#x6B65;-&#x7BE9;&#x9078;&#x8CC7;&#x6E90;"><a href="#&#x7B2C;&#x516D;&#x6B65;-&#x7BE9;&#x9078;&#x8CC7;&#x6E90;" class="headerlink" title="&#x7B2C;&#x516D;&#x6B65; - &#x7BE9;&#x9078;&#x8CC7;&#x6E90;"></a>&#x7B2C;&#x516D;&#x6B65; - &#x7BE9;&#x9078;&#x8CC7;&#x6E90;</h2><p>&#x5230;&#x9019;&#x6B65;&#xFF0C;&#x4F60;&#x61C9;&#x8A72;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x8A72;&#x5B78;&#x4EC0;&#x9EBC;&#x4E86;&#xFF0C;&#x73FE;&#x5728;&#x958B;&#x59CB;&#x6AA2;&#x8996;&#x8490;&#x96C6;&#x4F86;&#x7684;&#x8CC7;&#x6E90;&#xFF0C;&#x4E26;&#x5F9E;&#x4E2D;&#x7559;&#x4E0B;&#x5E7E;&#x500B;&#x54C1;&#x8CEA;&#x8F03;&#x9AD8;&#x4E14;&#x80FD;&#x5E6B;&#x52A9;&#x4F60;&#x5B8C;&#x6210;&#x5B78;&#x7FD2;&#x8A08;&#x756B;&#x7684;&#x8CC7;&#x6E90;&#x3002;</p>
<h2 id="&#x7B2C;&#x4E03;&#x6B65;-&#x958B;&#x59CB;&#x5B78;&#x7FD2;&#xFF0C;&#x6DFA;&#x5690;&#x8F12;&#x6B62;&#xFF1A;"><a href="#&#x7B2C;&#x4E03;&#x6B65;-&#x958B;&#x59CB;&#x5B78;&#x7FD2;&#xFF0C;&#x6DFA;&#x5690;&#x8F12;&#x6B62;&#xFF1A;" class="headerlink" title="&#x7B2C;&#x4E03;&#x6B65; - &#x958B;&#x59CB;&#x5B78;&#x7FD2;&#xFF0C;&#x6DFA;&#x5690;&#x8F12;&#x6B62;&#xFF1A;"></a>&#x7B2C;&#x4E03;&#x6B65; - &#x958B;&#x59CB;&#x5B78;&#x7FD2;&#xFF0C;&#x6DFA;&#x5690;&#x8F12;&#x6B62;&#xFF1A;</h2><p>&#x5728;&#x9019;&#x6B65;&#x9A5F;&#x6211;&#x5011;&#x9700;&#x8981;&#x638C;&#x63E1;&#x7576;&#x524D;&#x9805;&#x76EE;&#x7684;&#x77E5;&#x8B58;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x6DF1;&#x5165;&#xFF0C;&#x525B;&#x597D;&#x80FD;&#x8B93;&#x4F60;&#x5728;&#x4E0B;&#x4E00;&#x6B65;&#x64CD;&#x4F5C;&#x5373;&#x53EF;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x7684;&#x7406;&#x89E3;&#x662F;&#xFF0C;&#x5728;&#x9019;&#x6B65;&#x5148;&#x5F9E;&#x5B78;&#x7FD2;&#x8CC7;&#x6E90;&#x4E86;&#x89E3;&#x5927;&#x81F4;&#x4E0A;&#x600E;&#x9EBC;&#x505A;&#x5C31;&#x597D;&#xFF0C;&#x5230;&#x4E0B;&#x4E00;&#x6B65;&#x518D;&#x958B;&#x59CB;&#x5BE6;&#x4F5C;&#x3002;</p>
</blockquote>
<h2 id="&#x7B2C;&#x516B;&#x6B65;-&#x52D5;&#x624B;&#x64CD;&#x4F5C;&#xFF0C;&#x908A;&#x73A9;&#x908A;&#x5B78;&#xFF1A;"><a href="#&#x7B2C;&#x516B;&#x6B65;-&#x52D5;&#x624B;&#x64CD;&#x4F5C;&#xFF0C;&#x908A;&#x73A9;&#x908A;&#x5B78;&#xFF1A;" class="headerlink" title="&#x7B2C;&#x516B;&#x6B65; - &#x52D5;&#x624B;&#x64CD;&#x4F5C;&#xFF0C;&#x908A;&#x73A9;&#x908A;&#x5B78;&#xFF1A;"></a>&#x7B2C;&#x516B;&#x6B65; - &#x52D5;&#x624B;&#x64CD;&#x4F5C;&#xFF0C;&#x908A;&#x73A9;&#x908A;&#x5B78;&#xFF1A;</h2><p>&#x73FE;&#x5728;&#x6211;&#x5011;&#x5FC5;&#x9808;&#x5BE6;&#x969B;&#x64CD;&#x4F5C;&#x9AD4;&#x9A57;&#x4E00;&#x4E0B;&#xFF0C;&#x904E;&#x7A0B;&#x4E2D;&#xFF0C;&#x53EF;&#x80FD;&#x7522;&#x751F;&#x5404;&#x7A2E;&#x554F;&#x984C;&#xFF0C;&#x800C;&#x9019;&#x4E9B;&#x554F;&#x984C;&#x5373;&#x662F;&#x5C0D;&#x81EA;&#x5DF1;&#x4F86;&#x8AAA;&#x6700;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<p>&#x9019;&#x908A;&#x7522;&#x751F;&#x7684;&#x554F;&#x984C;&#x53EF;&#x80FD;&#x6703;&#x6709;&#x5169;&#x7A2E;&#x60C5;&#x6CC1;&#xFF1A;</p>
<ol>
<li><p>&#x5F71;&#x97FF;&#x4F60;&#x64CD;&#x4F5C;&#x7684;&#x554F;&#x984C;&#xFF1A;<br>&#x56DE;&#x53BB;&#x53C3;&#x95B1;&#x8CC7;&#x6E90;&#x4E26;&#x638C;&#x63E1;&#x4ED6;&#xFF0C;&#x8B93;&#x4F60;&#x80FD;&#x7E7C;&#x7E8C;&#x64CD;&#x4F5C;&#x3002;</p>
</li>
<li><p>&#x66AB;&#x4E14;&#x4E0D;&#x5F71;&#x97FF;&#x64CD;&#x4F5C;&#x7684;&#x554F;&#x984C;&#xFF1A;<br>&#x5148;&#x8A18;&#x9304;&#x4E0B;&#x4F86;&#xFF0C;&#x7B2C;&#x4E5D;&#x6B65;&#x518D;&#x53BB;&#x89E3;&#x6C7A;&#x3002;</p>
</li>
</ol>
<h2 id="&#x7B2C;&#x4E5D;&#x6B65;-&#x5168;&#x9762;&#x638C;&#x63E1;&#xFF0C;&#x5B78;&#x4EE5;&#x81F4;&#x7528;&#xFF1A;"><a href="#&#x7B2C;&#x4E5D;&#x6B65;-&#x5168;&#x9762;&#x638C;&#x63E1;&#xFF0C;&#x5B78;&#x4EE5;&#x81F4;&#x7528;&#xFF1A;" class="headerlink" title="&#x7B2C;&#x4E5D;&#x6B65; - &#x5168;&#x9762;&#x638C;&#x63E1;&#xFF0C;&#x5B78;&#x4EE5;&#x81F4;&#x7528;&#xFF1A;"></a>&#x7B2C;&#x4E5D;&#x6B65; - &#x5168;&#x9762;&#x638C;&#x63E1;&#xFF0C;&#x5B78;&#x4EE5;&#x81F4;&#x7528;&#xFF1A;</h2><p>&#x73FE;&#x5728;&#x6211;&#x5011;&#x53EF;&#x4EE5;&#x4F86;&#x8655;&#x7406;&#x7B2C;&#x516B;&#x6B65;&#x90A3;&#x4E9B;&#x8A18;&#x9304;&#x4E0B;&#x4F86;&#x9084;&#x672A;&#x89E3;&#x6C7A;&#x7684;&#x554F;&#x984C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x900F;&#x904E;&#x64CD;&#x4F5C;&#x3001;&#x5BE6;&#x9A57;&#x3001;&#x8207;&#x4EBA;&#x4EA4;&#x8AC7;&#x2026;&#x7B49;&#xFF0C;&#x5404;&#x7A2E;&#x65B9;&#x5F0F;&#x53BB;&#x627E;&#x5230;&#x554F;&#x984C;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x800C;&#x904E;&#x7A0B;&#x4E2D;&#x53EF;&#x80FD;&#x6703;&#x9047;&#x5230;&#x66F4;&#x591A;&#x554F;&#x984C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9078;&#x64C7;&#x518D;&#x7E7C;&#x7E8C;&#x6DF1;&#x5165;&#x3002;</p>
<blockquote>
<p>&#x4F46;&#x82E5;&#x5DF2;&#x7D93;&#x8D85;&#x8D8A;&#x5B78;&#x7FD2;&#x7BC4;&#x570D;&#x7684;&#x76F8;&#x95DC;&#x5167;&#x5BB9;&#xFF0C;&#x5EFA;&#x8B70;&#x5148;&#x8A18;&#x9304;&#x4E0B;&#x4F86;&#x4E26;&#x505C;&#x6B62;&#x7E7C;&#x7E8C;&#x6DF1;&#x5165;(&#x8ACB;&#x81EA;&#x884C;&#x62FF;&#x634F;)&#x3002;</p>
</blockquote>
<h2 id="&#x7B2C;&#x5341;&#x6B65;-&#x6A02;&#x70BA;&#x4EBA;&#x5E2B;&#xFF0C;&#x878D;&#x6703;&#x8CAB;&#x901A;&#xFF1A;"><a href="#&#x7B2C;&#x5341;&#x6B65;-&#x6A02;&#x70BA;&#x4EBA;&#x5E2B;&#xFF0C;&#x878D;&#x6703;&#x8CAB;&#x901A;&#xFF1A;" class="headerlink" title="&#x7B2C;&#x5341;&#x6B65; - &#x6A02;&#x70BA;&#x4EBA;&#x5E2B;&#xFF0C;&#x878D;&#x6703;&#x8CAB;&#x901A;&#xFF1A;"></a>&#x7B2C;&#x5341;&#x6B65; - &#x6A02;&#x70BA;&#x4EBA;&#x5E2B;&#xFF0C;&#x878D;&#x6703;&#x8CAB;&#x901A;&#xFF1A;</h2><p>&#x82E5;&#x8981;&#x5C07;&#x77E5;&#x8B58;&#x878D;&#x6703;&#x8CAB;&#x901A;&#xFF0C;&#x6700;&#x597D;&#x65B9;&#x5F0F;&#x5373;&#x70BA;&#x300C;&#x4EBA;&#x5E2B;&#x300D;&#xFF0C;&#x4E26;&#x7528;&#x5225;&#x4EBA;&#x80FD;&#x7406;&#x89E3;&#x7684;&#x65B9;&#x5F0F;&#x6559;&#x6388;&#x7D66;&#x4ED6;&#x4EBA;&#x3002;&#x800C;&#x5728;&#x9019;&#x904E;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F60;&#x5C07;&#x5256;&#x6790;&#x3001;&#x91CD;&#x7D44;&#x3001;&#x95DC;&#x806F;&#x81EA;&#x8EAB;&#x6240;&#x5B78;&#x7684;&#x77E5;&#x8B58;&#xFF0C; &#x767C;&#x73FE;&#x81EA;&#x5DF1;&#x7684;&#x76F2;&#x9EDE;&#x8207;&#x4E0D;&#x8DB3;&#xFF0C;&#x6700;&#x5F8C;&#x5C07;&#x77E5;&#x8B58;&#x8F49;&#x8B8A;&#x70BA;&#x81EA;&#x5DF1;&#x7684;&#x6771;&#x897F;&#x3002;</p>
<h2 id="&#x7D50;&#x8AD6;"><a href="#&#x7D50;&#x8AD6;" class="headerlink" title="&#x7D50;&#x8AD6;"></a>&#x7D50;&#x8AD6;</h2><p>&#x6216;&#x8A31;&#x6211;&#x5C0D;<strong>&#x5341;&#x6B65;&#x5B78;&#x7FD2;&#x6CD5;</strong>&#x7684;&#x7406;&#x89E3;&#x8207;&#x5176;&#x4ED6;&#x4EBA;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x5B78;&#x7FD2;&#x4E3B;&#x8981;&#x9084;&#x662F;&#x4EE5;&#x81EA;&#x5DF1;&#x70BA;&#x4E3B;&#xFF0C;&#x800C;&#x540C;&#x6A23;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x9069;&#x7528;&#x65BC;&#x6BCF;&#x500B;&#x4EBA;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x662F;&#x5728;&#x53C3;&#x8003;&#x5F8C;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x5957;&#x5C6C;&#x65BC;&#x81EA;&#x5DF1;&#x7684;&#x5B78;&#x7FD2;&#x65B9;&#x6CD5;&#x3002;&#x795D;&#x798F;&#x5404;&#x4F4D;&#x5728;&#x5B78;&#x7FD2;&#x7684;&#x9053;&#x8DEF;&#x4E0A;&#xFF0C;&#x4E5F;&#x80FD;&#x627E;&#x5230;&#x5C6C;&#x65BC;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>

      
    </div>
    <footer class="article-footer">
      <a data-url="http://yoursite.com/2017/02/25/10-step-learning/" data-id="cizlhvi3l0000lmrxkwm1iwxd" class="article-share-link">Share</a>
      
        <a href="http://yoursite.com/2017/02/25/10-step-learning/#disqus_thread" class="article-comment-link">Comments</a>
      
      
  <ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/十步學習法/">十步學習法</a></li></ul>

    </footer>
  </div>
  
    
<nav id="article-nav">
  
  
    <a href="/2016/12/30/build-hexo-blog-on-github/" id="article-nav-older" class="article-nav-link-wrap">
      <strong class="article-nav-caption">Older</strong>
      <div class="article-nav-title">使用Hexo和Github建立Blog</div>
    </a>
  
</nav>

  
</article>


<section id="comments">
  <div id="disqus_thread">
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
  </div>
</section>
</section>
        
          <aside id="sidebar">
  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Categories</h3>
    <div class="widget">
      <ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/個人成長/">個人成長</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tags</h3>
    <div class="widget">
      <ul class="tag-list"><li class="tag-list-item"><a class="tag-list-link" href="/tags/hexo/">hexo</a></li><li class="tag-list-item"><a class="tag-list-link" href="/tags/十步學習法/">十步學習法</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Tag Cloud</h3>
    <div class="widget tagcloud">
      <a href="/tags/hexo/" style="font-size: 10px;">hexo</a> <a href="/tags/十步學習法/" style="font-size: 10px;">十步學習法</a>
    </div>
  </div>

  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Archives</h3>
    <div class="widget">
      <ul class="archive-list"><li class="archive-list-item"><a class="archive-list-link" href="/archives/2017/02/">February 2017</a></li><li class="archive-list-item"><a class="archive-list-link" href="/archives/2016/12/">December 2016</a></li></ul>
    </div>
  </div>


  
    
  <div class="widget-wrap">
    <h3 class="widget-title">Recent Posts</h3>
    <div class="widget">
      <ul>
        
          <li>
            <a href="/2017/02/25/10-step-learning/">十步學習法</a>
          </li>
        
          <li>
            <a href="/2016/12/30/build-hexo-blog-on-github/">使用Hexo和Github建立Blog</a>
          </li>
        
      </ul>
    </div>
  </div>

  
</aside>
        
      </div>
      <footer id="footer">
  
  <div class="outer">
    <div id="footer-info" class="inner">
      &copy; 2017 Will Lai<br>
      Powered by <a href="http://hexo.io/" target="_blank">Hexo</a>
    </div>
  </div>
</footer>
    </div>
    <nav id="mobile-nav">
  
    <a href="/" class="mobile-nav-link">Home</a>
  
    <a href="/archives" class="mobile-nav-link">Archives</a>
  
</nav>
    
<script>
  var disqus_shortname = 'willest12034';
  
  var disqus_url = 'http://yoursite.com/2017/02/25/10-step-learning/';
  
  (function(){
    var dsq = document.createElement('script');
    dsq.type = 'text/javascript';
    dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>


<script src="//ajax.googleapis.com/ajax/libs/jquery/2.0.3/jquery.min.js"></script>


  <link rel="stylesheet" href="/fancybox/jquery.fancybox.css">
  <script src="/fancybox/jquery.fancybox.pack.js"></script>


<script src="/js/script.js"></script>

  </div>
</body>
</html>